# static
# ეს არის პოზიცია, რომელიც ყველაზე იპორე ინდიკატორია. ყველა ელემენტი, რომლისთვისაც არ არის სპეციალურად მითითებული სხვა პოზიცია, ავტომატურად მიეკუთვნება static-ს.

# relative
# relative პოზიციაში მდებარე ელემენტი ხდება მისი თავდაპირველი ადგილიდან გადაადგილებული, მაგრამ მაინც შენარჩუნებს თავისი ადგილის გავლენას გვერდზე.

# absolute
# absolute პოზიციაზე ელემენტი განლაგებულია იმის მიხედვით, თუ რა კონტეინერაში დევს. ანუ ის გამოდის დოკუმენტის ნაკადიდან და აბსოლუტური პოზიცია აქვს.

# fixed
# fixed ელემენტი შედგება ფიქსირებული პოზიციისგან, რაც ნიშნავს რომ ის განლაგდება viewport-თან შედარებით და არ შეიცვლება გვერდის გადახვევისას.