# დავალება 1: შეამოწმეთ, თუ მოცემული ციფრები არიან 10-ზე მეტი ან 50-ზე ნაკლები
# ამ დავალებაში უნდა გამოვიყენოთ OR ოპერატორი
number = 30
if number > 10 or number < 50:
    print("ციფრი არის 10-ზე მეტი ან 50-ზე ნაკლები.")
else:
    print("ციფრი არ შეესაბამება მოთხოვნას.")

# დავალება 2: შეამოწმეთ, არის თუ არა მოცემული ციფრი დადებითი ან ნული, თუმცა არ არის უარყოფითი
# ამ დავალებაში უნდა შევამოწმოთ, რომ ციფრი იყოს 0 ან დიდი
number = 5
if number >= 0:
    print("ციფრი არის დადებითი ან ნული.")
else:
    print("ციფრი უარყოფითია.")

# დავალება 3: შეამოწმეთ, თუ ცხოველი არის კატა თუ თაგვი
# ამ დავალებაში უნდა შევამოწმოთ ცხოველის სახელი და გამოვიყენოთ OR ოპერატორი
animal = "კატა"
if animal == "კატა" or animal == "თაგვი":
    print("ცხოველი არის კატა ან თაგვი.")
else:
    print("ცხოველი არ არის კატა ან თაგვი.")

# დავალება 4: შეამოწმეთ, თუ ერთი ციფრი უფრო დიდია 10-ზე ან მეორე ციფრი ნაკლებია 50-ზე
# ამ დავალებაში უნდა გამოვიყენოთ OR ოპერატორი
number1 = 15
number2 = 40
if number1 > 10 or number2 < 50:
    print("ერთი ციფრი უფრო დიდია 10-ზე ან მეორე ციფრი ნაკლებია 50-ზე.")
else:
    print("პირობები არ შესრულდა.")

# დავალება 5: შეამოწმეთ, შეყვანილი სიტყვა "hello"-ა თუ "hello world"
# ამ დავალებაში უნდა შევამოწმოთ, თუ შეყვანილი სიტყვა არის "hello" ან "hello world"
input_word = input("შეიყვანეთ სიტყვა: ")
if input_word == "hello" or input_word == "hello world":
    print("შეყვანილი სიტყვა არის hello ან hello world.")
else:
    print("შეყვანილი სიტყვა არ არის hello და არა hello world.")